{
  "sections": [
    {
      "section": "introduction",
      "id": "pendulum",
      "goals": "play",
      "color": "\"#009EA6\"",
      "level": "Advanced",
      "content": "# Chaos Theory\n\n## Introduction\n\n\nAt the beginning of the 18th century, physicists like [Isaac Newton](bio:newton)\nthought that the universe was a giant clockwork machine. If you had precise\ninformation about every object right now, you could use the laws of physics to\npredict what would happen in the future.\n\n::: column(width=320)\n\n    x-geopad.sticky.simulation(width=320 height=320)\n      canvas(width=640 height=640)\n      svg\n        circle(x=\"point(160,160)\" name=\"c\")\n        circle.move.red(name=\"p\")\n        path.thick.red(x=\"segment(c,p)\")\n      x-play-toggle\n\n::: column.grow\n\nOne great example is the pendulum. You’ve already seen how you can use\ndifferential equations to find an equation that calculates the position of the\npendulum at any time in the future.\n\nWe often say that the motion of the pendulum is __deterministic__: it precisely\nfollows Newton’s laws of gravity, and there is no randomness or probability.\nWatch the pendulum swinging, and try to predict what it’ll do next!\n\n:::"
    },
    {
      "id": "double-pendulum",
      "goals": "play1 play2",
      "content": "::: column(width=320)\n\n    x-geopad.sticky.simulation(width=320 height=320)\n      canvas(width=640 height=640)\n      svg\n        circle(x=\"point(160,160)\" name=\"c\")\n        path.thick.yellow(x=\"polyline(c,a1,a2)\" style=\"stroke-width: 7px; display: none\")\n        path.thick.green(x=\"polyline(c,b1,b2)\" style=\"stroke-width: 6px; display: none\")\n        path.thick.blue(x=\"polyline(c,c1,c2)\" style=\"stroke-width: 5px; display: none\")\n        circle.move.red(name=\"d1\")\n        circle.move.red(name=\"d2\")\n        path.thick.red(x=\"polyline(c,d1,d2)\")\n      x-play-toggle\n\n::: column.grow\n\nNow let’s try to make things a bit more interesting by attaching a second\npendulum to the first one – this is called a __double pendulum__.\n\nOnce again, watch its motion, and try to predict what it will do next. You can\neven close your eyes for a few seconds … was your prediction correct?\n\n{.reveal(when=\"play1\")} The double pendulum still follows Newton’s deterministic\nlaws of gravity, but the motion seems to [[be completely irregular|behave as if\nthere were no gravity|always repeat itself]].\n\n{.reveal(when=\"blank-0\")} This becomes every more apparent if we look at\nmultiple pendulums. Let’s add three more pendulums behind the first one, each\nwith a tiny, imperceptible change in their initial angle (less than 0.1°).\nPress play again and watch what happens!\n\n{.reveal(when=\"play2\")} At the beginning the four pendulums move along the\nsame path – but after a few seconds they [[separate|join up|alternate]]\n_{span.reveal(when=\"blank-1\")} and end up taking completely different paths._\n\n:::"
    },
    {
      "id": "double-pendulum-1",
      "content": "Mathematicians call this behaviour [__chaotic__](gloss:chaos): even if you know\nthe physical laws of the system, it is impossible to predict what might happen\nin the future. Tiny changes in the initial conditions are quickly amplified and\nlead to a completely different motion.\n\nIt is important to realise that _chaos_ is very different from _randomness_. The\ndouble pendulum contains no element of chance or probability. It follows the\nprecise, deterministic laws of gravity, and nevertheless moves completely\nunpredictably.\n\n{.r} Chaos appears in many unexpected places in nature and mathematics. In this\ncourse, we will explore some of these examples, and discover how mathematics can\nhelp us understand them.\n[Continue](btn:next)"
    },
    {
      "id": "butterfly",
      "content": "### The Butterfly Effect\n\n::: column.grow\n\nIn 1962, the mathematician [Edward Lorenz](bio:lorenz) was working at MIT, where\nhe was developing computer simulations of the atmosphere to predict the weather.\n\nLorenz had developed an algorithm that took current weather data like\ntemperature, humidity and wind speed as inputs. It then calculated how these\nvalues would change a few minutes into the future. By repeating the process over\nand over again, he was able to predict the weather days, or even weeks into the\nfuture.\n\n::: column(width=320)\n\n    x-img(src=\"images/lgp30.jpg\" width=320 height=280 alt=\"Computer used by Edward Lorenz\")\n\n{.caption} Edward Lorenz used an LGP-30, one of the first off-the-shelf\ncomputers.\n\n:::\n\nOne day, Lorenz decided to run parts of his simulation a second time, with the\nsame input data. To his surprise, the weather predictions created in both cases\nwere completely different!\n\n{.r} At first, Lorenz thought there must be a bug in the code – but he quickly\nworked out what was actually going on. When running the simulation a second time,\nhe had rounded some of the input values to fewer decimal places (for example\n0.506 instead of 0.506127). Even though the difference is tiny, less than 0.1%,\nit seems to have been enough to cause the simulation to make completely\ndifferent forecasts.\n[Continue](btn:next)"
    },
    {
      "id": "butterfly-1",
      "goals": "flap",
      "content": "::: column(width=280)\n\n    .r\n      x-water-canvas(width=280 height=380 src=\"images/america.jpg\")\n      .butterfly\n      .tornado\n    x-gesture(target=\".butterfly\")\n\n::: column.grow\n\nLorenz called this the __butterfly effect__: even the flap of a butterfly’s\nwings in Brazil might change the weather conditions enough to set off a tornado\nin Texas, at some point in the future.\n\nUsually, you’d expect a small change to the input parameters to also lead to a\nsmall change in the output. For chaotic systems, like the weather or the double\npendulum, the opposite is true. Even tiny changes can grow quickly, and lead\nto huge differences.\n\nThis is why weather prediction only works for a few days into the future. After\nthat, slightly inaccurate weather data can lead to completely different\nforecasts.\n\n:::"
    },
    {
      "id": "butterfly-2",
      "goals": "video",
      "content": "There is an important difference between _knowing the physical laws_ of a\nsystem, and being able to _predict its behaviour_. Newton’s laws of gravity tell\nus exactly how the double pendulum should move. The differential equations of\nfluid dynamics should, in principle, allow us to calculate the weather at any\ntime in the future.\n\nUnfortunately, for this to work in practice, we would have to measure the\ninitial state of the pendulum with infinite precision, or know the exact\nposition of every particle in the atmosphere – and that is clearly impossible.\nOver time, tiny measurement errors will completely throw off our predictions.\nIn other words, we can _never_ have a perfect weather forecast!\n\n::: figure\n\n    x-video(src=\"https://static.mathigon.org/videos/weather.mp4\" poster=\"images/weather.jpg\" width=640 height=360 controls credit=\"© NASA\")\n    // source: https://svs.gsfc.nasa.gov/12163\n\n{.caption} NASA uses satellites, planes and thousands of ground-based weather\nstations to take “snapshots” of the atmosphere: measuring important indicators\nlike wind speed, rainfall, humidity, air pressure, and ocean currents.\n\n:::\n\n    //- TODO Ensemble forecasting, spagetti plots for weather"
    },
    {
      "id": "dominoes",
      "goals": "video",
      "content": "Of course, a butterfly doesn’t actually _cause_ a tornado – but it might change\nthe conditions of the atmosphere just enough so that a tornado happens _now_\nrather than at some other time in the future.\n\nYou could think about it as a series of dominoes with increasing size. A small\naction that topples the first domino later leads to the largest domino falling:\n\n::: figure\n\n    x-video(src=\"images/dominoes.mp4\" poster=\"images/dominoes.jpg\" width=480 height=270 controls credit=\"© Gerrydomino, YouTube\")\n\n{.caption} The world’s largest domino toppling.\n\n:::"
    },
    {
      "id": "applications",
      "goals": "video",
      "content": "### More Applications\n\nYou’ve already seen that the double pendulum and the weather behave chaotically,\nbut there are countless other examples in nature and technology:\n\n::: column(width=200)\n\n    x-video(src=\"images/reaction.mp4\" poster=\"images/reaction.jpg\" width=200 height=200 credit=\"© Tim Kench, YouTube\")\n    // source: https://www.youtube.com/watch?v=PpyKSRo8Iec\n\n{.caption} The __Belousov–Zhabotinsky__ reaction occurs when you mix _bromate_\nwith an acid. (Shown at 20x speed, © Tim Kench)\n\n::: column(width=200)\n\n    x-img(lightbox src=\"images/finance.jpg\" width=200 height=200 alt=\"Stock Market Charts\")\n\n{.caption} __Stock markets__, inflation and other parts of the economy are\nchaotic, making them very difficult to predict.\n\n::: column(width=200)\n\n    x-img(lightbox src=\"images/heart.jpg\" width=200 height=200 alt=\"Heart\")\n\n{.caption} Scientists hope that explaining the origin of chaotic\n__heartbeats__ (_ventricular fibrillation_) can lead to a cure.\n\n    // Often life threatening abnomal heartbeat after a heart attack. Maybe\n    // chaos can predict this and help design better pacemakers.\n\n    // The main benefit to having a chaotic heart is that tiny variations in the\n    // way those millions of cells contract serves to distribute the load more\n    // evenly, reducing wear and tear on your heart and allowing it to pump\n    // decades longer than would otherwise be possible.\n\n::: column(width=200)\n\n    x-img(lightbox src=\"images/city.jpg\" width=200 height=200)\n\n{.caption} __Population dynamics__ often is chaotic – from the number of humans\nin a city, to rodent, fish or insect populations.\n\n::: column(width=200)\n\n    x-img(lightbox src=\"images/stars.jpg\" width=200 height=200 credit=\"Hubble/ESO\")\n\n{.caption} __Variable stars__ pulsate by altering their brightness over time.\nSome of these stars pulsate in a chaotic pattern.\n\n    // https://en.wikipedia.org/wiki/Stellar_pulsation\n\n::: column(width=200)\n\n    x-img(lightbox src=\"images/code.jpg\" width=200 height=200)\n\n{.caption} Computers can use chaotic systems to generate pseudo-__random\nnumbers__, or to securely encrypt images.\n\n:::"
    },
    {
      "id": "applications-1",
      "content": "Chaotic behaviour has also been found in electronic circuits, evolutionary\nbiology as well as dripping water taps, and scientists around the world are\nresearching many other applications.\n\n    // https://en.wikipedia.org/wiki/Chua%27s_circuit\n    // https://www.quantamagazine.org/can-scientists-predict-the-future-of-evolution-20140717/\n\nBut in all these examples, the existence of chaos means that there are\nfundamental limits to how well we can predict the future. This is often called\na __prediction horizon__, beyond which it is impossible to make any accurate\nforecasts.\n\n::: column(width=300)\n\n    x-img(src=\"images/forecast.jpg\" width=300 height=280)\n\n::: column.grow\n\nThe weather forecast currently has a prediction horizon of approximately one\nweek, and even with much better technology in the future, we might never surpass\ntwo weeks of accuracy.\n\n{.r} Instead, scientists can use probability to predict _averages_: for example\nhow often they’d expect certain weather events (like a tornado) to occur in a\nyear. These averages can be very accurate, even if we don’t know _when exactly_\na tornado might happen.\n[Continue](btn:next)\n\n:::"
    },
    {
      "id": "definitions",
      "content": "Let’s summarise the key properties of _chaos_ that we have discovered so far:\n\n::: .theorem\n\n* A __chaotic system__ follows precise, [[deterministic|probabilistic|unpredictable]]\n  laws, often described by one or more differential equations.\n* {.reveal(when=\"blank-0\")} Chaotic systems are highly __sensitive to change__.\n  [[Tiny|Large]] initial differences multiply over time and can lead to\n  [[huge|small|random]] differences in the result.\n* {.reveal(when=\"blank-1 blank-2\")} The behaviour is __unpredictable__ and\n  non-repeating. It might even _look random_, but only because it depends on\n  imperceptible changes or measurement errors.\n\n:::"
    },
    {
      "id": "definitions-1",
      "content": "Chaos theory tells us that we can never predict the future, or know in advance\nwhat outcome our actions might have. This can be worrying if you consider how\nmuch in our world depends on mathematical predictions: from modelling the wind\nflowing around airplanes or skyscrapers, to assessing the impact of climate\nchange."
    },
    {
      "id": "pool",
      "goals": "video",
      "section": "billiard",
      "sectionBackground": "dark casino",
      "sectionStatus": "dev",
      "content": "On the other hand, chaos theory and the butterfly effect were such simple and\npowerful ideas, that they soon started to appear in books, music lyrics, and\neven in movies:\n\n::: figure\n\n    x-video(src=\"https://static.mathigon.org/videos/jurassic-park.mp4\" poster=\"images/jurassic-park.jpg\" width=480 height=270 audio controls)\n\n{.caption} Extract from the movie _Jurassic Park_ (© Universal Pictures, 1993)\n\n:::\n\n\n\n--------------------------------------------------------------------------------\n\n\n\n## Mathematical Billiard\n\n\nOne of the most surprising properties of chaos is that it can appear in really\nsimple systems. You've already seen the double-pendulum in the previous section.\nAnother fascinating example are billiard tables.\n\n* https://plus.maths.org/content/chaos-billiard-table\n* https://en.wikipedia.org/wiki/Dynamical_billiards\n* http://mathworld.wolfram.com/Billiards.html\n* https://www.bristol.ac.uk/media-library/sites/pace/documents/corina-powerpoint%20standard.pdf\n* http://mathcircle.wustl.edu/uploads/4/9/7/9/49791831/20160306-billiards-presentation.pdf\n* http://people.maths.ox.ac.uk/tanner/Prospects2010/CUlcigraiTalk.pdf\n\n{.fixme} Imagine you are trying to predict the path a ball on a billiard table\nwill take in response to a push. The rules at play simple: the ball's\nacceleration is equal to the force applied divided by its mass (that's Newton's\nsecond law of motion) and when it hits a side, the angle of reflection is equal\nto the angle of incidence (strictly speaking you also need to include the effect\nof friction, but that's not too hard to do).\n\n{.fixme} The trouble is that in your average pub setting you can't easily\nmeasure the exact amount of force applied to the ball, the exact angle with\nwhich it hits a side, and so on. As you make your calculations, this small\ninitial uncertainty can snowball, so that pretty soon your prediction may\nbecome so uncertain as to be useless. That \"sensitivity to ignorance\" is the\nhallmark of mathematical chaos.\n\n    figure.r\n      svg(width=760 height=440 viewBox=\"0 0 760 440\")\n        rect.pool-table(x=15 y=15 width=730 height=410 rx=10 ry=10)\n      x-play-toggle(style=\"position: absolute; top: 30px; left: 30px\")\n\n{.fixme} Two billiard tables next to each other, move one ball a small amount\n\n{.fixme} Real Life Applications (semiconductors)"
    },
    {
      "content": "### Elliptical Billiard\n\nMove the yellow ball in the center, and see where it ends up after 100\ncollisions:\n\n    figure: x-pool-table: svg(width=760 height=440 viewBox=\"0 0 760 440\")"
    },
    {
      "section": "attractors",
      "id": "three-bodies",
      "sectionStatus": "dev",
      "content": "### Chaotic Scattering\n\n{.fixme} Gaspard–Rice system\n\n\n\n--------------------------------------------------------------------------------\n\n\n\n## The Three Body Problem\n\n\nPoincare etc.\n\n    figure: x-geopad.simulation.r(width=480 height=480)\n      canvas(width=960 height=960)\n      svg\n        circle.large.move.red(name=\"a\")\n        circle.large.move.blue(name=\"b\")\n        circle.large.move.green(name=\"c\")\n        path.thin(x=\"segment(a, a.translate(va))\" arrows=\"end\")\n        path.thin(x=\"segment(b, b.translate(vb))\" arrows=\"end\")\n        path.thin(x=\"segment(c, c.translate(vc))\" arrows=\"end\")\n      x-play-toggle\n      button.icon-btn.restore: x-icon(name=\"restart\")\n\n{.fixme} There are two chaotic systems which affect us greatly. The first is the weather. Although weather equations are pretty well understood and are solved by computers every day, it is impossible to take into account all the factors influencing the weather (remember the butterfly). No set of data is perfect, nor are computers perfect at solving the equations. The effects of these small\n errors build up remarkably quickly. After about ten days it is essentially impossible to forecast weather with any degree of accuracy.\n\n{.fixme} Chaos is also key to understanding the solar system. Whilst the motion of the planets is very predictable, the motion of many of the asteroids is not. Although asteroids do obey Newton's laws, they may well have orbits which move erratically about space. Such an erratic asteroid is thought to have hit the Earth 65 million years ago and wiped out the dinosaurs. The consequences of a similar\n incident occurring today are unthinkable; the nature of chaotic motion means that such events are virtually impossible to predict until too late.\n\n{.fixme} In 1887, the French mathematician Henri Poincaré showed that while Newton’s theory of gravity could perfectly predict how two planetary bodies would orbit under their mutual attraction, adding a third body to the mix rendered the equations unsolvable. The best we can do for three bodies is to predict their movements moment by moment, and feed those predictions back into our equations … Though the dance of the planets has a lengthy prediction horizon, the effects of chaos cannot be ignored, for the intricate interplay of gravitation tugs among the planets has a large influence on the trajectories of the asteroids. Keeping an eye on the asteroids is difficult but worthwhile, since such chaotic effects may one day fling an unwelcome surprise our way. On the flip side, they can also divert external surprises such as steering comets away from a potential collision with Earth.\n\n\n\n--------------------------------------------------------------------------------\n\n\n\n## Phase Space and Strange Attractors\n\n\nPhase diagram for pendulum:\nhttps://youtu.be/MjPFHWul2J0?t=29\n\ncircles => equilibrium\n\nspirals\nfriction => stable attractor\n\nFox + rabbit, dynamical systems\n\nPoincaré-Bendixson theorem (equilibrium, limit cycle)\n\nVector fields, equilibrium\n2D => simple, deterministic, 3D => not!"
    },
    {
      "section": "logistic-map",
      "sectionStatus": "dev",
      "content": "Water mill\n\nSinaï-Ruelle-Bowen measure / statistics / forecasting\n\n* https://www.youtube.com/watch?v=xQ3mJxr2NAY\n* https://bl.ocks.org/gcalmettes/c3363abb74fe219b283782f055b72386\n\n{.fixme} Mathematicians use the concept of a “phase space” to describe the possible behaviours of a system geometrically. Phase space is not (always) like regular space - each location in phase space corresponds to a different configuration of the system. The behaviour of the system can be observed by placing a point at the location representing the starting configuration and watching how that point moves through the phase space.\n\n{.fixme} In phase space, a stable system will move predictably towards a very simple attractor (which will look like a single point in the phase space if the system settles down, or a simple loop if the system cycles between different configurations repeatedly). A chaotic system will also move predictably towards its attractor in phase space - but instead of points or simple loops, we see “strange attractors” appear - complex and beautiful shapes (known as fractals) that twist and turn, intricately detailed at all possible scales.\n\n{.fixme} Another feature of chaotic systems is that they can suddenly flip from one behaviour to another, very different, one. Think about how some kinds of debt can suddenly become a risk rather than an asset to banks. Such a sudden change is known as a phase transition. One way to see a phase transition in action is to play with a tap. Turn it on very slowly and you hear a regular drip, drip,\n drip. Turn it up slightly and the drips become more frequent and not all the same size. A tiny bit more, and the drips become completely irregular and unpredictable: chaos sets in. Keep going, and the water settles down to a smooth column. However once you increase too much, the water starts twisting, frothing and spiralling: turbulence begins. By steadily increasing the flow we see regularity\n and chaos, without leaving the world of determinism.\n\n\n\n--------------------------------------------------------------------------------\n\n\n\n## The Logistic Map\n\n\n* https://www.dwitter.net/d/12018\n* https://geoffboeing.com/2015/03/chaos-theory-logistic-map/\n* Feigenbaum constant\n* https://www.youtube.com/watch?v=ovJcsL7vyrk\n* https://www.thegreatcourses.com/courses/chaos.html"
    }
  ],
  "title": "Chaos Theory"
}