{
  "sections": [
    {
      "section": "chapter-1",
      "color": "\"#0db0e3\"",
      "content": "# Cause or Correlation\n\n## Recognising dependence\n\n\n::: .theorem.blue\nIn this module, you will attempt to answer the question, cause or correlation? Or in other words,\ndoes changing one variable have an impact upon a different variable? This is important in many\ninstances in real life as it can alter the decisions you make, from a medical diagnosis to an\nenvironmental impact or a financial trend.\n\nYou will learn to recognise whether two variables are dependent on or independent of each other and\nbe able to distinguish the similarities and differences between dependence, correlation and cause.\n\nYou will learn about the connections between dependent behaviour and the cause for such behaviour,\nand how they are often misused. The final project will be to investigate whether or not there is\ncorrelation for a variety of real examples and whether any causation can be inferred.\n:::"
    },
    {
      "content": "### What is dependence?\n\nIn order to recognise dependence in mathematical visualisations and within data, you first need to\nunderstand what it is and how it differs from independence.\n\n__Dependence__ means that one variable is affected by another, as opposed to independence, which\nmeans the variable or event is as likely to happen regardless of other events that could or do occur.\n\nMany variable quantities in life are related to changes in other quantities. For example, the size\nof your shoes is related to your height.\n\nDecide if these variables are [dependent](gloss:dependent-events) (one affects the other) or\n[independent](gloss:independent-events) (one does not affect the other):\n\n    x-buckets\n      .inputs\n        .input(bucket=\"1\") The temperature of water from a hot tab, and the size of the tab.\n        .input(bucket=\"0\") The size of a computer screen, and the number of pixels it has.\n        .input(bucket=\"0\") The cost to rent a house (in a given area), and the number of bedrooms it has.\n        .input(bucket=\"1\") The weight of a baby at birth, and the day of the week on which it is born.\n        .input(bucket=\"0\") The time since the launch of a mobile phone, and the amount of storage it has.\n        .input(bucket=\"1\") The number of puppies a dog has, and the length of the tail of the dog.\n      .buckets\n        .bucket\n          .title Dependent\n        .bucket\n          .title Independent"
    },
    {
      "content": "### Do scatter plots help us recognise dependencies?\n\nNow that you understand the difference between a dependent and an independent event, you are ready\nto see if you can recognise them in data.\n\nTrends in scatter plots can help us to identify dependent events. Take a look at the examples below\nto see how they might be recognised.\n\n__Dependence__ is a term that is used when one variable affects the behaviour of another. Below are\nsix plots that may or may not have dependent x and y variables. Drag each slider slowly to the right\nand try to spot the trend. For further help, hover on the info icon in the top-right-hand corner.\n\n    iframe.wolfram(src=\"https://www.wolframcloud.com/obj/40e96625-73b4-4864-9539-c5ab7ac15a02\" width=600 height=240 frameborder=0)\n\nLet's see if you have understood how to recognise dependence within scatter plots.\n\n    iframe.wolfram(src=\"https://www.wolframcloud.com/obj/70b64565-c758-4d5c-ab4c-9b76e449b535\" width=360 height=235 frameborder=0)\n\nYou should now be able to identify a scatter plot that depicts a simple dependency and be able to\nsee whether a trend is going up or down."
    },
    {
      "section": "chapter-5",
      "content": "### Do scatter plots help us recognise the amount of dependency?\n\nThere are varying levels of dependence. For example, the amount of milk you can buy completely\ndepends on the amount of money you have, but how late a bus arrives is only slightly dependent on\na traffic light being red: it could also be affected by how many people took a long time to find\ntheir change, the amount of traffic on the road or the mood or driving habits of the bus driver. So\nwould the amount of dependence of these two events look different on a scatter plot?\n\nThe amount of dependence can be quantified on a scatter plot. It is time for you to see if you can\nspot these greater or lesser dependencies. You already know how to identify scatter plots depicting\nstrong upward or downward trends, but can you work out which ones have just some dependence or none\nat all?\n\nNow we will look at the same six plots and try to decide which of them show more dependence than\nothers. Drag them into a rank order, from the most dependent upward (positive) at the top to the\nmost dependent downward (negative) at the bottom.\n\n\n----------------------------------------------------------------------------------------------------\n\n\n## Measure linear dependency\n\n\nTODO\n\n\n----------------------------------------------------------------------------------------------------\n\n\n## Shortcomings of the correlation coefficient\n\n\nTODO\n\n\n----------------------------------------------------------------------------------------------------\n\n\n## Relation between correlation and causation\n\n\nTODO\n\n\n----------------------------------------------------------------------------------------------------\n\n\n## Project\n\n\nTODO"
    }
  ],
  "title": "Cause or Correlation"
}